config.org
#+title: Emacs Configuration
#+startup: overview

* Early-Init
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.6)
  (setq package-enable-at-startup nil)
  (setq package-quickstart nil)

  (setq frame-inhibit-implied-resize t)

  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq inhibit-splash-screen t)
  (setq use-file-dialog nil)

  (provide 'early-init)
#+end_src


* Init
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:

#+begin_src emacs-lisp
  ;; garbage collection
  (setq gc-cons-threshold (* 128 1024 1024))

  ;; ??? Process performance tuning
  (setq read-process-output-max (* 4 1024 1024))
  (setq process-adaptive-read-buffering nil)

  ;; add you personal config
  (dolist (dir '("lisp" "site-lisp" "test-lisp"))
    (push (expand-file-name dir user-emacs-directory) load-path))
  ;; add the subdirectory
  (dolist (dir '("site-lisp" "test-lisp"))
    (let ((default-directory (expand-file-name dir user-emacs-directory)))
      (normal-top-level-add-subdirs-to-load-path))) ;;how this work


  ;; Now we only need many require command
  ;;  (require 'init-base)

  ;; inside
  (require 'init-ui)
  (require 'init-theme)
  (require 'init-org)

  ;; outside
  (require 'init-rime)
  (require 'init-rainbow-delimiters)
  (require 'init-auto-save)
  (require 'init-which-key)
  (require 'init-aweshell)
  (require 'init-ivy)
  (require 'init-fingertip)
  (require 'init-yasnippet)
  (require 'init-lsp-bridge)
  (require 'init-avy)
  (require 'init-magit)
  (require 'init-dirvish)
  (require 'init-projectile)
  (require 'init-latex)

  (provide 'init)
#+end_src

* Lisp
** ui
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ui.el
:END:
#+begin_src emacs-lisp
  (setq visible-bell t)

  ;; display column number in the modeline
  (column-number-mode)

  ;; display line numbers and disable in some mode
  (global-display-line-numbers-mode t)

  ;; turn of the line numebr in the terminal
  ;; why it is useless
  ;; (dolist (mode '(org-mode-hook
  ;;                 term-mode-hook
  ;;                 shell-mode-hook
  ;;                 eshell-mode-hook))
  ;;   (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (provide 'init-ui)
#+end_src
** theme
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-theme.el
:END:
#+begin_src emacs-lisp
  (load-theme 'modus-operandi-tinted)

  (provide 'init-theme)
#+end_srcn

** org
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-org.el
:END:
*** ui
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode t)
  (setq org-hide-leading-stars t)
  (add-hook 'org-mode-hook 'org-num-mode)

  (with-eval-after-load 'org
    ;; Make verbatim with highlight text background.
    (add-to-list 'org-emphasis-alist
                 '("=" (:background "#ffee11")))
    ;; Make deletion (obsolete) text foreground with dark gray.
    (add-to-list 'org-emphasis-alist
                 '("+" (:foreground "dark gray"
                       :strike-through t)))
    ;; Make code style around with box.
    (add-to-list 'org-emphasis-alist
                 '("~" (:box (:line-width 2
                               :color "grey75"
                               :style released-button)))))
#+END_SRC

*** agenda
#+begin_src emacs-lisp
  (define-key global-map "\C-ca" 'org-agenda)

  (setq org-agenda-window-setup 'current-window)

  (setq org-directory "~/Documents/org/")
  (setq org-agenda-files '("~/Documents/org/agenda/"))

  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-timestamp-if-done t)

  ;; ??? what is this
  (setq org-agenda-start-with-log-mode t)
#+end_src

*** capture
set the org capture template
#+begin_src emacs-lisp
  (define-key global-map "\C-cc" 'org-capture)

  (setq org-capture-templates nil)

  (add-to-list 'org-capture-templates
  	     '("j" "Journal" entry (file+weektree "~/Documents/org/journal/journal.org")
  	       "* %?"))
  (add-to-list 'org-capture-templates
               '("i" "Inbox" entry (file "~/Documents/org/inbox.org")
                 "* %?\n"))
  (add-to-list 'org-capture-templates
               '("n" "Notes" entry (file "~/Documents/org/notes.org")
                 "* %^{heading} %t %^g\n  %?\n"))
  (add-to-list 'org-capture-templates
  	     '("e" "English Learning" entry
  	       (file+weektree "~/Documents/org/en-learn.org")
  	       "* \n\n** 1\n%?"))
  (add-to-list 'org-capture-templates
  	     '("s" "self-improve" entry
  	       (file+datetree "~/Documents/org/self-improve.org")
  	       "* %?"))
  (add-to-list 'org-capture-templates
  	     '("v" "vlog" entry
  	       (file+weektree "~/Documents/org/record.org")
  	       "* %?")) ;; C-c C-x C-i to start record C-c C-x C-o to end itt
#+end_src

#+begin_src emacs-lisp
  (provide 'init-org)
#+end_src
*** edit
here is some basic config helping for editing.
#+begin_src emacs-lisp
  (setq org-yank-image-file-name-function 'org-yank-image-read-filename)
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "C-M-y") 'yank-media)
    (define-key org-mode-map (kbd "C-M-Y") 'yank-media-types))

#+end_src

*** babel
only the language set here can be babeled.
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (C . t)))
#+end_src
*** appear
#+begin_src emacs-lisp
  (setq org-hide-emphasis-markers t)

  (require 'org-appear)
  (add-hook 'org-mode-hook 'org-appear-mode)
#+end_src
*** olivetti
#+begin_src emacs-lisp
  (require 'olivetti)
  (define-key global-map "\C-co" 'olivetti-mode)
#+end_src
*** END
#+begin_src emacs-lisp
  (provide 'init-org)
#+end_src
** emacs rime
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-rime.el
:END:
#+begin_src emacs-lisp
  ;; (require 'dash)
  ;; (require 'posframe)
  (require 'rime)

  ;; (setq rime-posframe-properties
  ;;       (list :background-color "#333333"
  ;;   	  :foreground-color "#dcdcdc"
  ;;   	  :internal-border-width 5))

  (setq default-input-method "rime"
        rime-show-candidate 'posframe)

  (setq rime-posframe-style 'vertical)

  (provide 'init-rime)
#+end_src

** rainbow delimiters
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-rainbow-delimiters.el
:END:
#+begin_src emacs-lisp
  (require 'rainbow-delimiters)

  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

  (provide 'init-rainbow-delimiters)
#+end_src

** auto save
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-auto-save.el
:END:
#+BEGIN_SRC emacs-lisp
  (require 'auto-save)

  (auto-save-enable)

  ;; quietly save
  (setq auto-save-silent t)

  ; automatically delete spaces at the end of the line when saving
  (setq auto-save-delete-trailing-whitespace t)

  ;;; custom predicates if you don't want auto save.
  ;;; disable auto save mode when current filetype is an gpg file.
  (setq auto-save-disable-predicates
        '((lambda ()
        (string-suffix-p
        "gpg"
        (file-name-extension (buffer-name)) t))))

  (provide 'init-auto-save)
#+END_SRC

** which key
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-which-key.el
:END:
#+begin_src emacs-lisp
  (require 'which-key)

  (setq which-key-idle-delay 0.5)
  (which-key-mode)

  (provide 'init-which-key)
#+end_src

** aweshell
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-aweshell.el
:END:
#+begin_src emacs-lisp
  (require 'aweshell)
  (define-key global-map "\C-ce" 'aweshell-toggle)

  (provide 'init-aweshell)
#+end_src

** ivy
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ivy.el
:END:
#+begin_src emacs-lisp

  (require 'ivy)
  (require 'swiper)
  (require 'counsel)
  (ivy-mode)
  (setopt ivy-use-virtual-buffers t)
  (setopt enable-recursive-minibuffers t)
  ;; Enable this if you want `swiper' to use it:
  ;; (setopt search-default-mode #'char-fold-to-regexp)
  (keymap-global-set "C-s" #'swiper-isearch)
  (keymap-global-set "C-c C-r" #'ivy-resume)
  (keymap-global-set "<f6>" #'ivy-resume)
  (keymap-global-set "M-x" #'counsel-M-x)
  (keymap-global-set "C-x C-f" #'counsel-find-file)
  (keymap-global-set "<f1> f" #'counsel-describe-function)
  (keymap-global-set "<f1> v" #'counsel-describe-variable)
  (keymap-global-set "<f1> o" #'counsel-describe-symbol)
  (keymap-global-set "<f1> l" #'counsel-find-library)
  (keymap-global-set "<f2> i" #'counsel-info-lookup-symbol)
  (keymap-global-set "<f2> u" #'counsel-unicode-char)
  (keymap-global-set "C-c g" #'counsel-git)
  (keymap-global-set "C-c j" #'counsel-git-grep)
  (keymap-global-set "C-c k" #'counsel-ag)
  (keymap-global-set "C-x l" #'counsel-locate)
  (keymap-global-set "C-S-o" #'counsel-rhythmbox)
  (keymap-set minibuffer-local-map "C-r" #'counsel-minibuffer-history)

  (provide 'init-ivy)
#+end_src

** fingertip
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-fingertip.el
:END:
#+begin_src emacs-lisp
  (require 'fingertip)

  (dolist (hook (list
                 'c-mode-common-hook
                 'c-mode-hook
                 'c++-mode-hook
                 'java-mode-hook
                 'haskell-mode-hook
                 'emacs-lisp-mode-hook
                 'lisp-interaction-mode-hook
                 'lisp-mode-hook
                 'maxima-mode-hook
                 'ielm-mode-hook
                 'sh-mode-hook
                 'makefile-gmake-mode-hook
                 'php-mode-hook
                 'python-mode-hook
                 'js-mode-hook
                 'go-mode-hook
                 'qml-mode-hook
                 'jade-mode-hook
                 'css-mode-hook
                 'ruby-mode-hook
                 'coffee-mode-hook
                 'rust-mode-hook
                 'rust-ts-mode-hook
                 'qmake-mode-hook
                 'lua-mode-hook
                 'swift-mode-hook
                 'web-mode-hook
                 'markdown-mode-hook
                 'llvm-mode-hook
                 'conf-toml-mode-hook
                 'nim-mode-hook
                 'typescript-mode-hook
                 'c-ts-mode-hook
                 'c++-ts-mode-hook
                 'cmake-ts-mode-hook
                 'toml-ts-mode-hook
                 'css-ts-mode-hook
                 'js-ts-mode-hook
                 'json-ts-mode-hook
                 'python-ts-mode-hook
                 'bash-ts-mode-hook
                 'typescript-ts-mode-hook

                 ))
    (add-hook hook #'(lambda () (fingertip-mode 1))))

  (define-key fingertip-mode-map (kbd "(") 'fingertip-open-round)
  (define-key fingertip-mode-map (kbd "[") 'fingertip-open-bracket)
  (define-key fingertip-mode-map (kbd "{") 'fingertip-open-curly)
  (define-key fingertip-mode-map (kbd ")") 'fingertip-close-round)
  (define-key fingertip-mode-map (kbd "]") 'fingertip-close-bracket)
  (define-key fingertip-mode-map (kbd "}") 'fingertip-close-curly)
  (define-key fingertip-mode-map (kbd "=") 'fingertip-equal)

  (define-key fingertip-mode-map (kbd "（") 'fingertip-open-chinese-round)
  (define-key fingertip-mode-map (kbd "「") 'fingertip-open-chinese-bracket)
  (define-key fingertip-mode-map (kbd "【") 'fingertip-open-chinese-curly)
  (define-key fingertip-mode-map (kbd "）") 'fingertip-close-chinese-round)
  (define-key fingertip-mode-map (kbd "」") 'fingertip-close-chinese-bracket)
  (define-key fingertip-mode-map (kbd "】") 'fingertip-close-chinese-curly)

  (define-key fingertip-mode-map (kbd "%") 'fingertip-match-paren)
  (define-key fingertip-mode-map (kbd "\"") 'fingertip-double-quote)
  (define-key fingertip-mode-map (kbd "'") 'fingertip-single-quote)

  (define-key fingertip-mode-map (kbd "SPC") 'fingertip-space)
  (define-key fingertip-mode-map (kbd "RET") 'fingertip-newline)

  (define-key fingertip-mode-map (kbd "M-o") 'fingertip-backward-delete)
  ;; (define-key fingertip-mode-map (kbd "C-d") 'fingertip-forward-delete)
  (define-key fingertip-mode-map (kbd "C-k") 'fingertip-kill)

  (define-key fingertip-mode-map (kbd "M-\"") 'fingertip-wrap-double-quote)
  (define-key fingertip-mode-map (kbd "M-'") 'fingertip-wrap-single-quote)
  (define-key fingertip-mode-map (kbd "M-[") 'fingertip-wrap-bracket)
  (define-key fingertip-mode-map (kbd "M-{") 'fingertip-wrap-curly)
  (define-key fingertip-mode-map (kbd "M-(") 'fingertip-wrap-round)
  (define-key fingertip-mode-map (kbd "M-)") 'fingertip-unwrap)

  (define-key fingertip-mode-map (kbd "M-p") 'fingertip-jump-right)
  (define-key fingertip-mode-map (kbd "M-n") 'fingertip-jump-left)
  (define-key fingertip-mode-map (kbd "M-:") 'fingertip-jump-out-pair-and-newline)

  (define-key fingertip-mode-map (kbd "C-j") 'fingertip-jump-up)


  (provide 'init-fingertip)
#+end_src

** yasnippet
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-yasnippet.el
:END:
#+begin_src emacs-lisp
  (require 'yasnippet)

  (yas-global-mode 1)

  (provide 'init-yasnippet)
#+end_src
** lsp bridge
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-lsp-bridge.el
:END:
#+begin_src emacs-lisp
  (require 'lsp-bridge)
  (require 'lsp-bridge-jdtls)

  ;;; Code:

  (setq lsp-bridge-enable-completion-in-minibuffer t)
  (setq lsp-bridge-signature-show-function 'lsp-bridge-signature-show-with-frame)
  (setq lsp-bridge-enable-with-tramp t)
  (setq lsp-bridge-enable-org-babel t)
  (setq acm-enable-capf t)
  (setq acm-enable-quick-access t)
  (setq acm-backend-yas-match-by-trigger-keyword t)
  (setq acm-enable-tabnine nil)
  (setq acm-enable-codeium nil)
  (setq acm-enable-lsp-workspace-symbol t)
  (setq lsp-bridge-enable-inlay-hint t)
  (setq lsp-bridge-semantic-tokens t)
  (setq-default lsp-bridge-semantic-tokens-ignore-modifier-limit-types ["variable"])

  (global-lsp-bridge-mode)

  (add-to-list 'lsp-bridge-multi-lang-server-extension-list '(("html") . "html_tailwindcss"))
  (add-to-list 'lsp-bridge-multi-lang-server-extension-list '(("css") . "css_tailwindcss"))

  (setq lsp-bridge-csharp-lsp-server "csharp-ls")
  (setq lsp-bridge-nix-lsp-server "nil")

  ;; 打开日志，开发者才需要
  ;; (setq lsp-bridge-enable-log t)

  (setq lsp-bridge-get-multi-lang-server-by-project
        (lambda (project-path filepath)
          ;; If typescript file include deno.land url, then use Deno LSP server.
          (save-excursion
            (when (string-equal (file-name-extension filepath) "ts")
              (dolist (buf (buffer-list))
                (when (string-equal (buffer-file-name buf) filepath)
                  (with-current-buffer buf
                    (goto-char (point-min))
                    (when (search-forward-regexp (regexp-quote "from \"https://deno.land") nil t)
                      (return "deno")))))))))

  (provide 'init-lsp-bridge)
#+end_src
** avy
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-avy.el
:END:
jump to everywhere quickly
#+begin_src emacs-lisp
  (require 'avy)

  (global-set-key (kbd "C-;") 'avy-goto-char-2)
  (global-set-key (kbd "C-'") 'avy-goto-char)
  (global-set-key (kbd "M-g f") 'avy-goto-line)
  (global-set-key (kbd "M-g w") 'avy-goto-word-1)
  (global-set-key (kbd "M-g e") 'avy-goto-word-0)

  (avy-setup-default)
  (global-set-key (kbd "C-c C-j") 'avy-resume)

  (provide 'init-avy)
#+end_src
** magit
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-magit.el
:END:
#+begin_src emacs-lisp
  ;; (add-to-list 'load-path "~/.emacs.d/site-lisp/compat")
  ;; (add-to-list 'load-path "~/.emacs.d/site-lisp/llama")
  ;; (add-to-list 'load-path "~/.emacs.d/site-lisp/transient/lisp")
  ;; (add-to-list 'load-path "~/.emacs.d/site-lisp/with-editor/lisp")
  ;; (require 'compat)
  ;; (require 'llama)
  ;; (require 'transient)
  ;; (require 'with-editor)

  (require 'magit)

  (with-eval-after-load 'info
    (info-initialize)
    (add-to-list 'Info-directory-list "~/.emacs.d/site-lisp/magit/docs/"))

  (provide 'init-magit)
#+end_src
** dirvish
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-dirvish.el
:END:
#+begin_src emacs-lisp
  (require 'dirvish)
  (define-key global-map "\C-xd" 'dirvish)
  (define-key dired-mode-map (kbd "b") 'dired-up-directory)

  (provide 'init-dirvish)
#+end_src
** projectile
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-projectile.el
:END:
#+begin_src emacs-lisp
  (require 'projectile)

  (projectile-mode +1)
  ;; Recommended keymap prefix on Windows/Linux
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

  (provide 'init-projectile)
#+end_src
** LaTex
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-latex.el
:END:
*** auctex
#+begin_src emacs-lisp
  (require 'auctex)

  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master t)
#+end_src
*** prettify-symbols-mode
#+begin_src emacs-lisp
  (add-hook 'LaTeX-mode-hook 'prettify-symbols-mode)
  (add-hook 'latex-mode-hook 'prettify-symbols-mode)

  (add-hook 'LaTeX-mode-hook
            (defun preview-larger-previews ()
              (setq preview-scale-function
                    (lambda () (* 1.25
                             (funcall (preview-scale-from-face)))))))
  (add-hook 'latex-mode-hook
            (defun preview-larger-previews ()
              (setq preview-scale-function
                    (lambda () (* 1.25
                             (funcall (preview-scale-from-face)))))))

  (setq prettify-symbols-unprettify-at-point t)
#+end_src
*** cdlatex

#+begin_src emacs-lisp
  (require 'cdlatex)

  (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
  (add-hook 'latex-mode-hook 'turn-on-cdlatex)
#+end_src
*** yasnippet
#+begin_src emacs-lisp
  (defun my/yas-try-expanding-auto-snippets ()
    (when (and (boundp 'yas-minor-mode)
  	     yas-minor-mode)
      (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
        (yas-expand))))

  ;; Try after every insertion
  (add-hook 'post-self-insert-hook #'my/yas-try-expanding-auto-snippets)
#+end_src
*** reftex
#+begin_src emacs-lisp
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (add-hook 'latex-mode-hook 'turn-on-reftex)
#+end_src
*** END
#+begin_src emacs-lisp
  (provide 'init-latex)
#+end_src
* Test
* QUSE
- [ ] what is the ~(set-fringe-mode 10)~
- [ ] custom my personal theme
- [ ] going to install the rime
- [ ] how the magit forge run
* INIT
:PROPERTIES:

:END:
** colorful-mode
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/site-lisp/colorful-mode/")
  (require 'colorful-mode)

  (setq colorful-use-prefix t)
  (setq colorful-only-strings 'only-prog)
  (setq css-fontify-colors nil)

  (global-colorful-mode t)
  (add-to-list 'global-colorful-modes 'helpful-mode)

#+end_src


** Font
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
    		    :family "JetBrainsMono")
#+end_src

** jinx
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/site-lisp/jinx/")
  (require 'jinx)

  (add-hook 'emacs-startup-hook #'global-jinx-mode)
#+end_src

** org-tree-slide
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/site-lisp/org-tree-slide/")
  (require 'org-tree-slide)
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "<f8>") 'org-tree-slide-mode)
    (define-key org-mode-map (kbd "S-<f8>") 'org-tree-slide-skip-done-toggle))

  ;; (when (require 'org-tree-slide nil t)
  ;;   (global-set-key (kbd "<f8>") 'org-tree-slide-mode)
  ;;   (global-set-key (kbd "S-<f8>") 'org-tree-slide-skip-done-toggle)
  ;;   (org-tree-slide-simple-profile))

  (with-eval-after-load "org-tree-slide"
    (define-key org-tree-slide-mode-map (kbd "<f9>") 'org-tree-slide-move-previous-tree)
    (define-key org-tree-slide-mode-map (kbd "<f10>") 'org-tree-slide-move-next-tree)
    )
#+end_src
 Edit
